ddxd001/gugaPI/gugaPI/empty_cpp.syscfg
GPIO7.$name                          = "GPIO_LED_B";
GPIO7.port                           = "PORTB";
GPIO7.portSegment                    = "Upper";
GPIO7.associatedPins[0].$name        = "LED3";
GPIO7.associatedPins[0].initialValue = "SET";
GPIO7.associatedPins[0].assignedPin  = "27";

GPIO8.$name                              = "GPIO_GY931_I2C";
GPIO8.port                               = "PORTA";
GPIO8.portSegment                        = "Upper";
GPIO8.associatedPins.create(2);
GPIO8.associatedPins[0].$name            = "GY931_SCL";
GPIO8.associatedPins[0].direction        = "INPUT";
GPIO8.associatedPins[0].internalResistor = "PULL_UP";
GPIO8.associatedPins[0].assignedPin      = "29";
GPIO8.associatedPins[1].$name            = "GY931_SDA";
GPIO8.associatedPins[1].direction        = "INPUT";
GPIO8.associatedPins[1].internalResistor = "PULL_UP";
GPIO8.associatedPins[1].assignedPin      = "30";

GPIO9.$name                         = "GPIO_GRAY_C";
GPIO9.port                          = "PORTC";
GPIO9.portSegment                   = "Upper";
GPIO9.associatedPins.create(2);
GPIO9.associatedPins[0].$name       = "GRAY_SEL0";
GPIO9.associatedPins[0].assignedPin = "21";
GPIO9.associatedPins[1].$name       = "GRAY_SEL1";
GPIO9.associatedPins[1].assignedPin = "20";

GPIO10.$name                         = "GPIO_GRAY_A";
GPIO10.port                          = "PORTA";
GPIO10.portSegment                   = "Upper";
GPIO10.associatedPins[0].$name       = "GRAY_SEL2";
GPIO10.associatedPins[0].assignedPin = "16";

GPIO11.$name                         = "GPIO_CAN_CTRL";
GPIO11.port                          = "PORTC";
GPIO11.portSegment                   = "Upper";
GPIO11.associatedPins[0].$name       = "CAN_STB";
GPIO11.associatedPins[0].assignedPin = "25";

I2C1.basicEnableController                 = true;
I2C1.basicControllerBusSpeed               = 400000;
I2C1.$name                                 = "SENSOR_I2C";
I2C1.advAnalogGlitchFilter                 = "DISABLED";
I2C1.DMAEvent1                             = "CONTROLLER_TXFIFO_TRIGGER";
I2C1.intController                         = ["EVENT1_DMA_DONE"];
I2C1.peripheral.$assign                    = "I2C2";
I2C1.peripheral.sdaPin.$assign             = "PC3";
I2C1.peripheral.sclPin.$assign             = "PC2";
I2C1.sdaPinConfig.hideOutputInversion      = scripting.forceWrite(false);
I2C1.sdaPinConfig.onlyInternalResistor     = scripting.forceWrite(false);
I2C1.sdaPinConfig.passedPeripheralType     = scripting.forceWrite("Digital");
I2C1.sdaPinConfig.$name                    = "ti_driverlib_gpio_GPIOPinGeneric6";
I2C1.sclPinConfig.hideOutputInversion      = scripting.forceWrite(false);
I2C1.sclPinConfig.onlyInternalResistor     = scripting.forceWrite(false);
I2C1.sclPinConfig.passedPeripheralType     = scripting.forceWrite("Digital");
I2C1.sclPinConfig.$name                    = "ti_driverlib_gpio_GPIOPinGeneric7";
I2C1.DMA_CHANNEL_EVENT1.$name              = "SENSOR_I2C_DMA_TX";
I2C1.DMA_CHANNEL_EVENT1.addressMode        = "b2f";
I2C1.DMA_CHANNEL_EVENT1.srcLength          = "BYTE";
I2C1.DMA_CHANNEL_EVENT1.dstLength          = "BYTE";
I2C1.DMA_CHANNEL_EVENT1.peripheral.$assign = "DMA_CH1";

I2C2.basicEnableController             = true;
I2C2.basicControllerBusSpeed           = 400000;
I2C2.$name                             = "MOTOR_I2C";
I2C2.peripheral.$assign                = "I2C1";
I2C2.peripheral.sdaPin.$assign         = "PA10";
I2C2.peripheral.sclPin.$assign         = "PA11";
I2C2.sdaPinConfig.hideOutputInversion  = scripting.forceWrite(false);
I2C2.sdaPinConfig.onlyInternalResistor = scripting.forceWrite(false);
I2C2.sdaPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
I2C2.sdaPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric8";
I2C2.sclPinConfig.hideOutputInversion  = scripting.forceWrite(false);
I2C2.sclPinConfig.onlyInternalResistor = scripting.forceWrite(false);
I2C2.sclPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
I2C2.sclPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric9";

MCAN1.$name                            = "CAN_BUS";
MCAN1.fdMode                           = false;
MCAN1.desiredNomRate                   = 250;
MCAN1.spPercent                        = 80;
MCAN1.additionalCoreConfig             = true;
MCAN1.wkupReqEnable                    = true;
MCAN1.autoWkupEnable                   = true;
MCAN1.emulationEnable                  = true;
MCAN1.rrfe                             = true;
MCAN1.rrfs                             = true;
MCAN1.lss                              = 0;
MCAN1.flesa                            = 0;
MCAN1.lse                              = 0;
MCAN1.txStartAddr                      = 0;
MCAN1.txBufNum                         = 1;
MCAN1.txBufElemSize                    = "DL_MCAN_ELEM_SIZE_8BYTES";
MCAN1.txEventFIFOStartAddr             = 4;
MCAN1.txEventFIFOSize                  = 0;
MCAN1.rxFIFO0startAddr                 = 16;
MCAN1.rxFIFO0size                      = 16;
MCAN1.rxFIFO0waterMark                 = 0;
MCAN1.rxFIFO0ElemSize                  = "DL_MCAN_ELEM_SIZE_8BYTES";
MCAN1.rxFIFO1startAddr                 = 0;
MCAN1.rxFIFO1size                      = 0;
MCAN1.rxFIFO1waterMark                 = 0;
MCAN1.rxFIFO1ElemSize                  = "DL_MCAN_ELEM_SIZE_8BYTES";
MCAN1.rxBufStartAddr                   = 272;
MCAN1.rxBufElemSize                    = "DL_MCAN_ELEM_SIZE_8BYTES";
MCAN1.enableInterrupt                  = true;
MCAN1.interruptFlags                   = ["DL_MCAN_INTERRUPT_BO","DL_MCAN_INTERRUPT_EP","DL_MCAN_INTERRUPT_EW","DL_MCAN_INTERRUPT_MRAF","DL_MCAN_INTERRUPT_PEA","DL_MCAN_INTERRUPT_PED","DL_MCAN_INTERRUPT_RF0L","DL_MCAN_INTERRUPT_RF0N","DL_MCAN_INTERRUPT_TC","DL_MCAN_INTERRUPT_TCF"];
MCAN1.interruptLine                    = ["DL_MCAN_INTR_LINE_NUM_1"];
MCAN1.interruptLine1Flag               = ["DL_MCAN_INTR_MASK_ALL"];
MCAN1.m0interrupts                     = ["DL_MCAN_MSP_INTERRUPT_LINE1"];
MCAN1.overrideRetention                = true;
MCAN1.peripheral.$assign               = "CANFD1";
MCAN1.peripheral.rxPin.$assign         = "PC27";
MCAN1.peripheral.txPin.$assign         = "PC26";
MCAN1.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
MCAN1.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
MCAN1.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
MCAN1.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
MCAN1.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric16";
MCAN1.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
MCAN1.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
MCAN1.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
MCAN1.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric17";

SPI1.$name                              = "IMU_SPI";
SPI1.targetBitRate                      = 1000000;
SPI1.frameFormat                        = "MOTO3";
SPI1.polarity                           = "1";
SPI1.phase                              = "1";
SPI1.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.sclkPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric10";
SPI1.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
SPI1.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.mosiPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric11";
SPI1.misoPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.misoPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.misoPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric12";
SPI1.peripheral.sclkPin.$assign         = "PB18";
SPI1.peripheral.mosiPin.$assign         = "PB17";
SPI1.peripheral.misoPin.$assign         = "PB19";

SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn           = true;
SYSCTL.validateClkStatus     = true;
SYSCTL.SYSPLL_CLK1En         = true;

UART1.$name                             = "DEBUG_UART";
UART1.interruptPriority                 = "2";
UART1.rxFifoThreshold                   = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART1.targetBaudRate                    = 115200;
UART1.enableFIFO                        = true;
UART1.txFifoThreshold                   = "DL_UART_TX_FIFO_LEVEL_ONE_ENTRY";
UART1.enableDMARX                       = false;
UART1.enabledDMATXTriggers              = "DL_UART_DMA_INTERRUPT_TX";
UART1.enabledInterrupts                 = ["DMA_DONE_TX","RX"];
UART1.peripheral.$assign                = "UART6";
UART1.peripheral.rxPin.$assign          = "PC10";
UART1.peripheral.txPin.$assign          = "PC11";
UART1.txPinConfig.direction             = scripting.forceWrite("OUTPUT");
UART1.txPinConfig.hideOutputInversion   = scripting.forceWrite(false);
UART1.txPinConfig.onlyInternalResistor  = scripting.forceWrite(false);
UART1.txPinConfig.passedPeripheralType  = scripting.forceWrite("Digital");
UART1.txPinConfig.$name                 = "ti_driverlib_gpio_GPIOPinGeneric0";
UART1.rxPinConfig.hideOutputInversion   = scripting.forceWrite(false);
UART1.rxPinConfig.onlyInternalResistor  = scripting.forceWrite(false);
UART1.rxPinConfig.passedPeripheralType  = scripting.forceWrite("Digital");
UART1.rxPinConfig.$name                 = "ti_driverlib_gpio_GPIOPinGeneric1";
UART1.DMA_CHANNEL_TX.$name              = "DEBUG_UART_DMA_TX";
UART1.DMA_CHANNEL_TX.addressMode        = "b2f";
UART1.DMA_CHANNEL_TX.srcLength          = "BYTE";
UART1.DMA_CHANNEL_TX.dstLength          = "BYTE";
UART1.DMA_CHANNEL_TX.peripheral.$assign = "DMA_CH0";

UART2.$name                            = "LORA_UART";
UART2.interruptPriority                = "2";
UART2.rxFifoThreshold                  = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART2.targetBaudRate                   = 115200;
UART2.enableFIFO                       = true;
UART2.txFifoThreshold                  = "DL_UART_TX_FIFO_LEVEL_3_4_EMPTY";
UART2.enableDMARX                      = false;
UART2.enableDMATX                      = false;
UART2.enabledInterrupts                = ["RX"];
UART2.peripheral.$assign               = "UART3";
UART2.peripheral.rxPin.$assign         = "PA13";
UART2.peripheral.txPin.$assign         = "PA14";
UART2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric2";
UART2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric3";

