ddxd001/gugaPI/gugaPI/empty_cpp.syscfg
UART3.$name                            = "MOTOR_UART";
UART3.interruptPriority                = "0";
UART3.rxFifoThreshold                  = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART3.targetBaudRate                   = 115200;
UART3.enableFIFO                       = true;
UART3.txFifoThreshold                  = "DL_UART_TX_FIFO_LEVEL_3_4_EMPTY";
UART3.enableDMARX                      = false;
UART3.enableDMATX                      = false;
UART3.enabledInterrupts                = ["RX"];
UART3.peripheral.$assign               = "UART1";
UART3.peripheral.rxPin.$assign         = "PA9";
UART3.peripheral.txPin.$assign         = "PA8";
UART3.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART3.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric4";
UART3.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric5";

UART4.$name                            = "INFRARED_UART";
UART4.interruptPriority                = "0";
UART4.rxFifoThreshold                  = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART4.targetBaudRate                   = 115200;
UART4.enableFIFO                       = true;
UART4.txFifoThreshold                  = "DL_UART_TX_FIFO_LEVEL_3_4_EMPTY";
UART4.enableDMARX                      = true;
UART4.enableDMATX                      = false;
UART4.enabledDMARXTriggers             = "DL_UART_DMA_INTERRUPT_RX";
UART4.enabledInterrupts                = ["DMA_DONE_RX"];
UART4.peripheral.$assign               = "UART0";
UART4.peripheral.rxPin.$assign         = "PA1";
UART4.peripheral.txPin.$assign         = "PA0";
UART4.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART4.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART4.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART4.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART4.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric13";
UART4.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART4.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART4.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART4.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric15";
UART4.DMA_CHANNEL_RX.$name             = "INFRARED_UART_DMA_RX";
UART4.DMA_CHANNEL_RX.addressMode       = "f2b";
UART4.DMA_CHANNEL_RX.transferMode      = "FULL_CH_REPEAT_SINGLE";
UART4.DMA_CHANNEL_RX.srcLength         = "BYTE";
UART4.DMA_CHANNEL_RX.dstLength         = "BYTE";
UART4.DMA_CHANNEL_RX.peripheral.$assign = "DMA_CH2";

const ProjectConfig              = scripting.addModule("/ti/project_config/ProjectConfig", {}, false);
ProjectConfig.migrationCondition = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
GPIO1.associatedPins[0].pin.$suggestSolution  = "PA27";
GPIO1.associatedPins[1].pin.$suggestSolution  = "PA26";
GPIO2.associatedPins[0].pin.$suggestSolution  = "PC16";
GPIO3.associatedPins[0].pin.$suggestSolution  = "PC9";
GPIO4.associatedPins[0].pin.$suggestSolution  = "PB20";
GPIO4.associatedPins[1].pin.$suggestSolution  = "PB23";
GPIO5.associatedPins[0].pin.$suggestSolution  = "PC6";
GPIO5.associatedPins[1].pin.$suggestSolution  = "PC7";
GPIO5.associatedPins[2].pin.$suggestSolution  = "PC8";
GPIO6.associatedPins[0].pin.$suggestSolution  = "PA22";
GPIO6.associatedPins[1].pin.$suggestSolution  = "PA31";
GPIO7.associatedPins[0].pin.$suggestSolution  = "PB27";
GPIO8.associatedPins[0].pin.$suggestSolution  = "PA29";
GPIO8.associatedPins[1].pin.$suggestSolution  = "PA30";
GPIO9.associatedPins[0].pin.$suggestSolution  = "PC21";
GPIO9.associatedPins[1].pin.$suggestSolution  = "PC20";
GPIO10.associatedPins[0].pin.$suggestSolution = "PA16";
GPIO11.associatedPins[0].pin.$suggestSolution = "PC25";
SPI1.peripheral.$suggestSolution              = "SPI0";
UART4.peripheral.$suggestSolution             = "UART0";
